Retrieve a backward moving iterator to the array.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public virtual DimensionSegmentArrayIterator ReverseIterator()
  Visual Basic
Public Overridable Function ReverseIterator As DimensionSegmentArrayIterator
  Visual C++
public:
virtual DimensionSegmentArrayIterator^ ReverseIterator()
 Return Value
 Returns a backward moving iterator to the array.
 See Also
  DimensionSegmentArray Class
  Autodesk.Revit.DB Namespace